DataProcessors/АК_ПредложенияПоставщиковПоПочте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>АК_ПредложенияПоставщиковПоПочте</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ящик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключаемыеСообщения</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаСообщений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаОтправления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отправитель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тема</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПочты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пропуск</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСообщения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/АК_ИсточникиПоступающихПредложений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>АК_ИсточникиПоступающихПредложений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Почта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сайт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Файл</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/НазначенияУчетнойЗаписи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>НазначенияУчетнойЗаписи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПерепискаСКандидатами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/АК_ПоступающиеПредложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>АК_ПоступающиеПредложения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СовпадениеИНН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидБизнеса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродуктоваяКатегория</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемыПроизводстваРеализации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ассортимент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипыИВидыУпаковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Comment>Идентификационный номер налогоплательщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПроизводства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьКонтактногоЛица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновныеКлиенты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоставкаВМоскву</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводствоПодМаркойВВ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АК_СтатусыПоступающихПредложений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Технолог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БрендМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Презентация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаКоординат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>41</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоординатыОпределены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УправлениеКачества</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АК_УправлениеКачества</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УправляющийПоКачеству</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РуководительПоТрейдМаркетингу</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АК_ИсточникиПоступающихПредложений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РольПродуктоваяКатегория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКладр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоработкаРецептуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НоменклатурныеГруппы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПродуктовыеГруппы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПродуктоваяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПродуктовыеГруппыПоставщиков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/АК_ПредложенияПоставщиковПоПочте/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Получить(Команда)
	ПоказатьОповещениеПользователя("Просмотр почты",,"Получение заголовков");
	ПолучитьЗаголовкиНаСервере();
	ПоказатьОповещениеПользователя("Просмотр почты",,"Проверка загруженных предложений");
//	ПроверитьЗагрузкуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗагрузкуНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ТаблицаСообщений.ИдентификаторПочты КАК СТРОКА(100)) КАК ИдентификаторПочты,
		|	ТаблицаСообщений.ДатаОтправления,
		|	ТаблицаСообщений.Отправитель,
		|	ТаблицаСообщений.Тема,
		|	ТаблицаСообщений.ИдентификаторСообщения
		|ПОМЕСТИТЬ Сообщения
		|ИЗ
		|	&ТаблицаСообщений КАК ТаблицаСообщений
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ИдентификаторПочты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Сообщения.ДатаОтправления,
		|	Сообщения.Отправитель,
		|	Сообщения.Тема,
		|	Сообщения.ИдентификаторПочты,
		|	Сообщения.ИдентификаторСообщения,
		|	ВЫБОР
		|		КОГДА АК_ПоступающиеПредложения.Ссылка ЕСТЬ NULL 
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Пропуск,
		|	ВЫРАЗИТЬ(Сообщения.Отправитель КАК СТРОКА(100)) КАК Отправитель100
		|ПОМЕСТИТЬ СводнаяТаблица
		|ИЗ
		|	Сообщения КАК Сообщения
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АК_ПоступающиеПредложения КАК АК_ПоступающиеПредложения
		|		ПО Сообщения.ИдентификаторПочты = АК_ПоступающиеПредложения.ИдентификаторПочты
		|ГДЕ
		|	АК_ПоступающиеПредложения.Источник = &ИсточникПочта
		|	И НЕ АК_ПоступающиеПредложения.ИдентификаторПочты = &ПустаяСтрока
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СводнаяТаблица.ДатаОтправления КАК ДатаОтправления,
		|	СводнаяТаблица.Отправитель КАК Отправитель,
		|	СводнаяТаблица.Тема,
		|	СводнаяТаблица.ИдентификаторПочты,
		|	СводнаяТаблица.ИдентификаторСообщения,
		|	СводнаяТаблица.Пропуск
		|ИЗ
		|	СводнаяТаблица КАК СводнаяТаблица
		//|ГДЕ
		//|	НЕ СводнаяТаблица.Пропуск
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаОтправления,
		|	СводнаяТаблица.Отправитель100";

	Запрос.Параметры.Вставить("ТаблицаСообщений",Объект.ТаблицаСообщений.Выгрузить());
	Запрос.Параметры.Вставить("ИсточникПочта",Перечисления.АК_ИсточникиПоступающихПредложений.Почта);
	Запрос.Параметры.Вставить("ПустаяСтрока","");
		
	Объект.ТаблицаСообщений.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

&НаСервере
Процедура ПолучитьЗаголовкиНаСервере()
	
		Почта = ПолучитьИнтернетПочту();
		МассивСообщений = Новый Массив;
		
		Попытка
			Почта.ТекущийПочтовыйЯщик=Объект.Ящик;
			
	        сообщить("Текущий ящик: "+Почта.ТекущийПочтовыйЯщик);
			
			сообщить("Чтение почтовых сообщений "+ТекущаяДата());
			
			ПараметрыОтбора = Новый Структура;
			//ПараметрыОтбора.Вставить("Новые", Истина);
			ПараметрыОтбора.Вставить("ПослеДатыОтправления", Дата(2016,1,31));
			
			//МассивСообщений = Почта.ПолучитьЗаголовки(ПараметрыОтбора);
			МассивСообщений = Почта.ПолучитьЗаголовки();
	    Исключение
	        сообщить("Ошибка подключения к серверу");
	        сообщить(""+ОписаниеОшибки());
	        Возврат;
	    КонецПопытки;
		
		сообщить("Сообщения получены "+ТекущаяДата());
		
		Если МассивСообщений.Количество() = 0 Тогда
			сообщить("В почтовом ящике нет сообщений. Прерываем работу.");
			Сообщить("Почтовый ящик пуст");
		//	//ПолученныеПисьма.Очистить();
		//	Возврат;
		иначе
		    сообщить("Сообщения: "+МассивСообщений.Количество());

			Обработано=0;
			НеобходимоПолучить=новый Массив;
			Для Каждого Сообщение из МассивСообщений цикл
				
				Если Сообщение.Тема="ВкусВилл: на сайте заполнена анкета нового поставщика" тогда
					продолжить;
				КонецЕсли;
				
				Если НЕ Объект.ИсключаемыеСообщения.НайтиПоЗначению(Сообщение.ИдентификаторСообщения)=Неопределено тогда
					Продолжить;
				КонецЕсли;
				
				ИдентификаторПочты=""+Сообщение.ИдентификаторСообщения+";"+нрег(стрзаменить(Сообщение.Отправитель.Адрес," ",""))+";"+Сообщение.ДатаОтправления;

				СтрокаСообщения=Объект.ТаблицаСообщений.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаСообщения,Сообщение,"ДатаОтправления,Тема,ИдентификаторСообщения");
				СтрокаСообщения.ИдентификаторПочты=ИдентификаторПочты;
				СтрокаСообщения.Отправитель=Сообщение.Отправитель.Адрес;
				
				
 //   			Запрос.УстановитьПараметр("ИдентификаторПочты", ИдентификаторПочты);

 //   			СообщениеНеЗагружено = Запрос.Выполнить().Пустой();
 //
 //   			Если СообщениеНеЗагружено тогда
 //   				НеобходимоПолучить.Добавить(Сообщение);
 //   			КонецЕсли;
			КонецЦикла;

            //возврат;

			МассивСообщений=Почта.Выбрать(Ложь,НеобходимоПолучить);
			Для Каждого Сообщение из МассивСообщений цикл
				КоличествоВложений=Сообщение.Вложения.Количество();
				Если КоличествоВложений>0 тогда
					
					Обработано=Обработано+1;
				иначе
					Если Объект.ИсключаемыеСообщения.НайтиПоЗначению(Сообщение.ИдентификаторСообщения)=Неопределено тогда
						Объект.ИсключаемыеСообщения.Добавить(Сообщение.ИдентификаторСообщения);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			Сообщить("Обработано: "+Обработано);
		КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Процедура УчетнаяЗаписьПриИзменении(Элемент)
	ЗаполнитьСписокПапокНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокПапокНаСервере()
	ПолучитьИнтернетПочту();
КонецПроцедуры

&НаСервере
Функция ПолучитьИнтернетПочту(ЗаполнитьЯщики=Истина)
	Профиль = новый ИнтернетПочтовыйПрофиль;
    Почта = Новый ИнтернетПочта;
	Если ЗначениеЗаполнено(Объект.УчетнаяЗапись) тогда
		УчетнаяЗапись=Объект.УчетнаяЗапись;
		Если найти(врег(УчетнаяЗапись.POP3Сервер),"IMAP")>0 тогда
			Профиль.ИспользоватьSSLIMAP = Истина;        
			Профиль.АдресСервераIMAP =	УчетнаяЗапись.POP3Сервер;        
			Профиль.ПортIMAP = 			УчетнаяЗапись.ПортPOP3;        
			Профиль.ПользовательIMAP = 	УчетнаяЗапись.Логин;        
			Профиль.ПарольIMAP = 		УчетнаяЗапись.Пароль;        
			Протокол = ПротоколИнтернетПочты.IMAP;        
		иначе
			Профиль.АдресСервераPOP3 =	УчетнаяЗапись.POP3Сервер;        
			Профиль.ПортPOP3 = 			УчетнаяЗапись.ПортPOP3;        
			Профиль.Пользователь =	 	УчетнаяЗапись.Логин;        
			Профиль.Пароль = 			УчетнаяЗапись.Пароль;        
			Протокол = ПротоколИнтернетПочты.POP3;        
		КонецЕсли;
		Профиль.Таймаут = 15;        
		
		Попытка
	        Почта.Подключиться(Профиль,Протокол);
	    Исключение
	        сообщить("Ошибка подключения к серверу");
	        сообщить(""+ОписаниеОшибки());
			ЗаполнитьЯщики=Ложь;
		КонецПопытки;
		
		Если ЗаполнитьЯщики тогда
		
			Элементы.Ящик.СписокВыбора.Очистить();
				
			ПочтовыеЯщики = Новый Массив;            
			ПочтовыеЯщики = Почта.ПолучитьПочтовыеЯщики(); 
			
			Если ПочтовыеЯщики.Найти(Объект.Ящик)=Неопределено тогда
				Объект.Ящик="";
			КонецЕсли;
			
			ЯщикПоУмолчанию=ВРег("TEST");
			
			НовыйЯщик="";
			Для Каждого Ящик из ПочтовыеЯщики цикл
				Если врег(Ящик)=ЯщикПоУмолчанию тогда
					Объект.Ящик=Ящик;
					Маркер="1.";
				Иначе 
					Маркер="";
				КонецЕсли;
				Если врег(Ящик)="INBOX" тогда
					Элементы.Ящик.СписокВыбора.Добавить(Ящик,Маркер+"Входящие");
				иначе
					Элементы.Ящик.СписокВыбора.Добавить(Ящик,Маркер+Ящик);
				КонецЕсли;
				Если ПустаяСтрока(Объект.Ящик) и Врег(Ящик)=ЯщикПоУмолчанию тогда
					Объект.Ящик=Ящик;
				КонецЕсли;
			КонецЦикла;
			Элементы.Ящик.СписокВыбора.СортироватьПоПредставлению();
		КонецЕсли;
	КонецЕсли;
	возврат Почта;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	КаталогФайнРидер = Константы.КаталогФайнРидер.Получить();
	
	Если Прав(КаталогФайнРидер, 1) <> "\" Тогда
		КаталогФайнРидер = КаталогФайнРидер + "\";
	КонецЕсли;	
	КаталогФайнРидер=СтрЗаменить(врег(КаталогФайнРидер),врег("\sticker\"),"");
	
	КаталогДок=КаталогФайнРидер+"\DOC\";
	
	ИмяФайлаИсключений=КаталогДок="исключаемые_сообщения.txt";
	
	ФайлИсключение = Новый Файл(ИмяФайлаИсключений);
	Если ФайлИсключение.Существует() Тогда
		Попытка
			ИсключаемыеСообщения=ЗначениеИзФайла(ИмяФайлаИсключений);
		Исключение
			ИсключаемыеСообщения=Неопределено;
		КонецПопытки;
		Если ТипЗнч(ИсключаемыеСообщения)=Тип("Массив") тогда
			Объект.ИсключаемыеСообщения.ЗагрузитьЗначения(ИсключаемыеСообщения);
		КонецЕсли;
	КонецЕсли;
	
	                                        
	Адрес="zakupka@vkusvill.ru";
	УчетнаяЗапись=Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию(Адрес);
	
	Если ЗначениеЗаполнено(УчетнаяЗапись) тогда
		//УчетнаяЗапись=УчетнаяЗапись.получитьобъект();
		Объект.УчетнаяЗапись=УчетнаяЗапись;
	иначе
		УчетнаяЗапись=Справочники.УчетныеЗаписиЭлектроннойПочты.СоздатьЭлемент();
	//КонецЕсли;	
		УчетнаяЗапись.Наименование=Адрес;
		
		УчетнаяЗапись.АдресЭлектроннойПочты=Адрес;
		УчетнаяЗапись.Логин=Адрес;
		УчетнаяЗапись.Пароль="asDzqA15";
		УчетнаяЗапись.POP3Сервер="imap.yandex.ru";
		УчетнаяЗапись.ПортPOP3=993;
		УчетнаяЗапись.ОставлятьКопииСообщенийНаСервере=Истина;
		УчетнаяЗапись.ВремяОжиданияСервера=15;
		
		УчетнаяЗапись.НазначениеУчетнойЗаписи=Перечисления.НазначенияУчетнойЗаписи.Прочее;
		
		УчетнаяЗапись.ОбменДанными.Загрузка=Истина;
		УчетнаяЗапись.Записать();
		
		Объект.УчетнаяЗапись=УчетнаяЗапись.Ссылка;
	КонецЕсли;
	ЗаполнитьСписокПапокНаСервере();	
	
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если Объект.ИсключаемыеСообщения.Количество()>0 тогда
		СохранитьИсключенияНаСервере();
	КонецЕсли;
КонецПроцедуры
	
&НаСервере
Процедура СохранитьИсключенияНаСервере()
	ЗначениеВФайл(ИмяФайлаИсключений,Объект.ИсключаемыеСообщения.ВыгрузитьЗначения());
КонецПроцедуры
